NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/modules/OpenQBMM/tutorials/diluteVdfTransportFoam/rotatingCylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;
boundaryField
{
    walls
    {
        type    zeroGradient;
    }
    defaultFaces
    {
        type    empty;
    }
}


// ************************************************************************* //
